import { variable } from './module';

console.log(variable);
console.log(variable);
console.log(variable); 


// import { variable, и тут название функции например из другого файла - типа igogo } from './module';


// благодаря этой штуке можно делать модульность, в одном файле функции в другом константы в третьем еще чтото хз
// когда у тебя 100500 тысяч строк кода то можно погибнуть просто его скроля не говоря уже о поддержке кода

// бекграундатачментфиксед - это просто почитай левак про параллакс
